from cli import run_menu
from rich.console import Console

console = Console()

def exibir_banner():
    console.print("""
[bold cyan]
 ███╗   ██╗███████╗████████╗ ██████╗ ██████╗ ███████╗
 ████╗  ██║██╔════╝╚══██╔══╝██╔═══██╗██╔══██╗██╔════╝
 ██╔██╗ ██║█████╗     ██║   ██║   ██║██████╔╝███████╗
 ██║╚██╗██║██╔══╝     ██║   ██║   ██║██╔═══╝ ╚════██║
 ██║ ╚████║███████╗   ██║   ╚██████╔╝██║     ███████║
 ╚═╝  ╚═══╝╚══════╝   ╚═╝    ╚═════╝ ╚═╝     ╚══════╝
[/bold cyan]
[dim]  Canivete Suíço de Redes — by @bastosfjp[/dim]
""")

if __name__ == "__main__":
    exibir_banner()
    run_menu()